app/controllers/posts_controller.rb

  def create
    @post = Post.create(post_params)
---
INSERT INTO "posts" ("caption", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "caption" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_file_name", "prince.jpg"], ["image_file_size", 103867], ["image_updated_at", "2018-03-18 17:55:32.173716"], ["caption", "test"], ["updated_at", "2018-03-18 17:55:32.321906"], ["id", 1]]